index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-08-28 ven. 12:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<title>Active Damping of Rotating Platforms using Integral Force Feedback</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Thomas Dehaeze" />
<link rel="stylesheet" type="text/css" href="css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Active Damping of Rotating Platforms using Integral Force Feedback
<br />
<span class="subtitle">Dehaeze Thomas, Collette Christophe</span>
</h1>
<blockquote>
<p>
<b>Abstract</b>:
</p>

<p>
This paper investigates the use of Integral Force Feedback (IFF) for the active damping of rotating mechanical systems.
Guaranteed stability, typical benefit of IFF, is lost as soon as the system is rotating due to gyroscopic effects.
To overcome this issue, two modifications of the classical IFF control scheme are proposed.
The first consists of slightly modifying the control law while the second consists of adding springs in parallel with the force sensors.
Conditions for stability and optimal parameters are derived.
The results reveal that, despite their different implementations, both modified IFF control scheme have almost identical damping authority on suspension modes.
</p>
</blockquote>

<div id="outline-container-org8a3e56b" class="outline-2">
<h2 id="org8a3e56b">Paper (<a href="paper/dehaeze20_activ_dampin_rotat_platf_integ_force_feedb.pdf">link</a>)</h2>
<div class="outline-text-2" id="text-org8a3e56b">
<p>
The paper has been created using <a href="https://orgmode.org/">Org Mode</a> (generating <a href="https://www.latex-project.org/">LaTeX</a> code) under <a href="https://www.gnu.org/software/emacs/">Emacs</a>.
</p>
</div>
</div>

<div id="outline-container-org9a11af3" class="outline-2">
<h2 id="org9a11af3">Matlab Scripts (<a href="matlab/index.html">link</a>)</h2>
<div class="outline-text-2" id="text-org9a11af3">
<p>
The Matlab scripts that permits to obtain all the results presented in the paper are accessible <a href="matlab/index.html">here</a>.
</p>
</div>
</div>

<div id="outline-container-org542f0c3" class="outline-2">
<h2 id="org542f0c3">Figures (<a href="tikz/index.html">link</a>)</h2>
<div class="outline-text-2" id="text-org542f0c3">
<p>
All the figures in the paper are generated using either <a href="https://sourceforge.net/projects/pgf/">TikZ</a> or <a href="https://inkscape.org/">Inkscape</a>. The code snippets that was used to generate the figures are accessible <a href="tikz/index.html">here</a>.
</p>
</div>
</div>

<div id="outline-container-org0f7ddc7" class="outline-2">
<h2 id="org0f7ddc7">Cite this paper</h2>
<div class="outline-text-2" id="text-org0f7ddc7">
<p>
To cite this paper use the following bibtex code.
</p>
<div class="org-src-container">
<pre class="src src-bibtex">@inproceedings{dehaeze20_activ_dampin_rotat_platf_integ_force_feedb,
  author          = {Dehaeze, T. and Collette, C.},
  title           = {Active Damping of Rotating Platforms using Integral Force
                  Feedback},
  booktitle       = {Proceedings of the International Conference on Modal
                  Analysis Noise and Vibration Engineering (ISMA)},
  year            = 2020,
}
</pre>
</div>

<p>
You can also use the formatted citation below.
</p>
<blockquote>
<p>
Dehaeze, T., &amp; Collette, C., Active damping of rotating platforms using integral force feedback, In , Proceedings of the International Conference on Modal Analysis Noise and Vibration Engineering (ISMA) (pp. ) (2020)
</p>
</blockquote>
</div>
</div>
</div>
</body>
</html>
